CoreMaker-lab/STM32H503_LSM6DSV16X_LIS2MDL/STM32H503_LSM6DSV16X_LIS2MDL_Project5/Core/Inc/lsm6dsv16x_reg.h
typedef enum
{
  LSM6DSV16X_PROTECT_CTRL_REGS = 0x0,
  LSM6DSV16X_WRITE_CTRL_REG    = 0x1,
} lsm6dsv16x_fsm_permission_t;
int32_t lsm6dsv16x_fsm_permission_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16x_fsm_permission_t val);
int32_t lsm6dsv16x_fsm_permission_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16x_fsm_permission_t *val);
int32_t lsm6dsv16x_fsm_permission_status(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t fsm1_en              : 1;
  uint8_t fsm2_en              : 1;
  uint8_t fsm3_en              : 1;
  uint8_t fsm4_en              : 1;
  uint8_t fsm5_en              : 1;
  uint8_t fsm6_en              : 1;
  uint8_t fsm7_en              : 1;
  uint8_t fsm8_en              : 1;
} lsm6dsv16x_fsm_mode_t;
int32_t lsm6dsv16x_fsm_mode_set(const stmdev_ctx_t *ctx, lsm6dsv16x_fsm_mode_t val);
int32_t lsm6dsv16x_fsm_mode_get(const stmdev_ctx_t *ctx, lsm6dsv16x_fsm_mode_t *val);

int32_t lsm6dsv16x_fsm_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16x_fsm_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);


typedef struct
{
  uint8_t fsm_outs1;
  uint8_t fsm_outs2;
  uint8_t fsm_outs3;
  uint8_t fsm_outs4;
  uint8_t fsm_outs5;
  uint8_t fsm_outs6;
  uint8_t fsm_outs7;
  uint8_t fsm_outs8;
} lsm6dsv16x_fsm_out_t;
int32_t lsm6dsv16x_fsm_out_get(const stmdev_ctx_t *ctx, lsm6dsv16x_fsm_out_t *val);

typedef enum
{
  LSM6DSV16X_FSM_15Hz  = 0x0,
  LSM6DSV16X_FSM_30Hz  = 0x1,
  LSM6DSV16X_FSM_60Hz  = 0x2,
  LSM6DSV16X_FSM_120Hz = 0x3,
  LSM6DSV16X_FSM_240Hz = 0x4,
  LSM6DSV16X_FSM_480Hz = 0x5,
  LSM6DSV16X_FSM_960Hz = 0x6,
} lsm6dsv16x_fsm_data_rate_t;
int32_t lsm6dsv16x_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fsm_data_rate_t val);
int32_t lsm6dsv16x_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16x_fsm_data_rate_t *val);

int32_t lsm6dsv16x_fsm_ext_sens_sensitivity_set(const stmdev_ctx_t *ctx,
                                                uint16_t val);
int32_t lsm6dsv16x_fsm_ext_sens_sensitivity_get(const stmdev_ctx_t *ctx,
                                                uint16_t *val);

typedef struct
{
  uint16_t z;
  uint16_t y;
  uint16_t x;
} lsm6dsv16x_xl_fsm_ext_sens_offset_t;
int32_t lsm6dsv16x_fsm_ext_sens_offset_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv16x_xl_fsm_ext_sens_offset_t val);
int32_t lsm6dsv16x_fsm_ext_sens_offset_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv16x_xl_fsm_ext_sens_offset_t *val);

typedef struct
{
  uint16_t xx;
  uint16_t xy;
  uint16_t xz;
  uint16_t yy;
  uint16_t yz;
  uint16_t zz;
} lsm6dsv16x_xl_fsm_ext_sens_matrix_t;
int32_t lsm6dsv16x_fsm_ext_sens_matrix_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv16x_xl_fsm_ext_sens_matrix_t val);
int32_t lsm6dsv16x_fsm_ext_sens_matrix_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv16x_xl_fsm_ext_sens_matrix_t *val);

typedef enum
{
  LSM6DSV16X_Z_EQ_Y     = 0x0,
  LSM6DSV16X_Z_EQ_MIN_Y = 0x1,
  LSM6DSV16X_Z_EQ_X     = 0x2,
  LSM6DSV16X_Z_EQ_MIN_X = 0x3,
  LSM6DSV16X_Z_EQ_MIN_Z = 0x4,
  LSM6DSV16X_Z_EQ_Z     = 0x5,
} lsm6dsv16x_fsm_ext_sens_z_orient_t;
int32_t lsm6dsv16x_fsm_ext_sens_z_orient_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_z_orient_t val);
int32_t lsm6dsv16x_fsm_ext_sens_z_orient_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_z_orient_t *val);

typedef enum
{
  LSM6DSV16X_Y_EQ_Y     = 0x0,
  LSM6DSV16X_Y_EQ_MIN_Y = 0x1,
  LSM6DSV16X_Y_EQ_X     = 0x2,
  LSM6DSV16X_Y_EQ_MIN_X = 0x3,
  LSM6DSV16X_Y_EQ_MIN_Z = 0x4,
  LSM6DSV16X_Y_EQ_Z     = 0x5,
} lsm6dsv16x_fsm_ext_sens_y_orient_t;
int32_t lsm6dsv16x_fsm_ext_sens_y_orient_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_y_orient_t val);
int32_t lsm6dsv16x_fsm_ext_sens_y_orient_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_y_orient_t *val);

typedef enum
{
  LSM6DSV16X_X_EQ_Y     = 0x0,
  LSM6DSV16X_X_EQ_MIN_Y = 0x1,
  LSM6DSV16X_X_EQ_X     = 0x2,
  LSM6DSV16X_X_EQ_MIN_X = 0x3,
  LSM6DSV16X_X_EQ_MIN_Z = 0x4,
  LSM6DSV16X_X_EQ_Z     = 0x5,
} lsm6dsv16x_fsm_ext_sens_x_orient_t;
int32_t lsm6dsv16x_fsm_ext_sens_x_orient_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_x_orient_t val);
int32_t lsm6dsv16x_fsm_ext_sens_x_orient_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_fsm_ext_sens_x_orient_t *val);

int32_t lsm6dsv16x_fsm_long_cnt_timeout_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16x_fsm_long_cnt_timeout_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16x_fsm_number_of_programs_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_fsm_number_of_programs_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_fsm_start_address_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsv16x_fsm_start_address_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsv16x_ff_time_windows_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_ff_time_windows_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_156_mg = 0x0,
  LSM6DSV16X_219_mg = 0x1,
  LSM6DSV16X_250_mg = 0x2,
  LSM6DSV16X_312_mg = 0x3,
  LSM6DSV16X_344_mg = 0x4,
  LSM6DSV16X_406_mg = 0x5,
  LSM6DSV16X_469_mg = 0x6,
  LSM6DSV16X_500_mg = 0x7,
} lsm6dsv16x_ff_thresholds_t;
int32_t lsm6dsv16x_ff_thresholds_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv16x_ff_thresholds_t val);
int32_t lsm6dsv16x_ff_thresholds_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv16x_ff_thresholds_t *val);

typedef enum
{
  LSM6DSV16X_MLC_OFF                             = 0x0,
  LSM6DSV16X_MLC_ON                              = 0x1,
  LSM6DSV16X_MLC_ON_BEFORE_FSM                   = 0x2,
} lsm6dsv16x_mlc_mode_t;
int32_t lsm6dsv16x_mlc_set(const stmdev_ctx_t *ctx, lsm6dsv16x_mlc_mode_t val);
int32_t lsm6dsv16x_mlc_get(const stmdev_ctx_t *ctx, lsm6dsv16x_mlc_mode_t *val);

